<a href="https://colab.research.google.com/github/jvicmaina/titanic-dataset/blob/main/Un.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#In this file we will be predicting a persons probability to have survived the titanic crash and also my submission for the Kaggle competition.

In [12]:

import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [13]:
#load data using seaborn library
titanic = sns.load_dataset ('titanic')

In [14]:
# here we are printing the first 5 rows of the titanic dataset.
titanic.head(5)

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [21]:
titanic.shape
#checking for the number of rows and columns for titanic

(891, 15)

In [32]:
#url = 'https://github.com/jvicmaina/titanic-dataset.git'
#df = pd.read_csv(url)
# Dataset is now stored in a Pandas Dataframe
df = pd.read_csv('/content/test.csv', header=0, sep=',')
#df = df[0].str.split(',', expand=True)

In [33]:
df.head(10)

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S
5          897       3  ...   NaN        S
6          898       3  ...   NaN        Q
7          899       2  ...   NaN        S
8          900       3  ...   NaN        C
9          901       3  ...   NaN        S

[10 rows x 11 columns]

In [34]:
df.shape
#checking for the number of rows and columns for our new df

(418, 11)

In [35]:
#create a visual picture of how the data looks like
df.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200